### 1. Load Data And Libraries

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
customer = pd.read_csv('Customers.csv',encoding='latin1') #encoding='latin1' is used when the data set has special characters

In [3]:
customer.dtypes

CustomerKey     int64
Gender         object
Name           object
City           object
State Code     object
State          object
Zip Code       object
Country        object
Continent      object
Birthday       object
dtype: object

In [4]:
customer.shape

(15266, 10)

In [5]:
customer.head()

,CustomerKey,Gender,Name,City,State Code,State,Zip Code,Country,Continent,Birthday
0,301,Female,Lilly Harding,WANDEARAH EAST,SA,South Australia,5523,Australia,Australia,7/3/1939
1,325,Female,Madison Hull,MOUNT BUDD,WA,Western Australia,6522,Australia,Australia,9/27/1979
2,554,Female,Claire Ferres,WINJALLOK,VIC,Victoria,3380,Australia,Australia,5/26/1947
3,786,Male,Jai Poltpalingada,MIDDLE RIVER,SA,South Australia,5223,Australia,Australia,9/17/1957
4,1042,Male,Aidan Pankhurst,TAWONGA SOUTH,VIC,Victoria,3698,Australia,Australia,11/19/1965

In [6]:
customer.describe() # Summary statistics for numberical columns

        CustomerKey
count  1.526600e+04
mean   1.060508e+06
std    6.127097e+05
min    3.010000e+02
25%    5.140335e+05
50%    1.079244e+06
75%    1.593980e+06
max    2.099937e+06

In [7]:
customer.describe(include ='object') # summary statistics for categorical columns

,Gender,Name,City,State Code,State,Zip Code,Country,Continent,Birthday
count,15266,15266,15266,15256,15266,15266,15266,15266,15266
unique,2,15118,8258,467,512,9505,8,3,11270
top,Male,John Smith,Toronto,CA,California,90017,United States,North America,5/29/1965
freq,7748,4,204,740,715,70,6828,8381,5

In [8]:
data = pd.read_csv('Data_Dictionary.csv',encoding='latin1')

In [9]:
data.dtypes

Table          object
Field          object
Description    object
dtype: object

In [10]:
data.shape

(37, 3)

In [11]:
data.head()

   Table          Field                                        Description
0  Sales   Order Number                           Unique ID for each order
1  Sales      Line Item  Identifies individual products purchased as pa...
2  Sales     Order Date                          Date the order was placed
3  Sales  Delivery Date                       Date the order was delivered
4  Sales    CustomerKey  Unique key identifying which customer placed t...

In [12]:
data.describe()

            Table     Field               Description
count          37        37                        37
unique          5        32                        37
top     Customers  StoreKey  Unique ID for each order
freq           10         2                         1

In [13]:
data.describe(include = 'object')

            Table     Field               Description
count          37        37                        37
unique          5        32                        37
top     Customers  StoreKey  Unique ID for each order
freq           10         2                         1

In [14]:
exr = pd.read_csv('Exchange_Rates.csv')

In [15]:
exr.head()

       Date Currency  Exchange
0  1/1/2015      USD    1.0000
1  1/1/2015      CAD    1.1583
2  1/1/2015      AUD    1.2214
3  1/1/2015      EUR    0.8237
4  1/1/2015      GBP    0.6415

In [16]:
exr.dtypes

Date         object
Currency     object
Exchange    float64
dtype: object

In [17]:
exr.shape

(11215, 3)

In [18]:
exr.describe()

           Exchange
count  11215.000000
mean       1.061682
std        0.245519
min        0.628500
25%        0.857800
50%        1.000000
75%        1.311900
max        1.725300

In [19]:
exr.describe(include ='object')

             Date Currency
count       11215    11215
unique       2243        5
top     2/20/2021      USD
freq            5     2243

In [20]:
sales=pd.read_csv('Sales.csv',encoding='latin1')

In [21]:
sales.dtypes

Order Number      int64
Line Item         int64
Order Date       object
Delivery Date    object
CustomerKey       int64
StoreKey          int64
ProductKey        int64
Quantity          int64
Currency Code    object
dtype: object

In [22]:
sales.shape

(62884, 9)

In [23]:
sales.head()

,Order Number,Line Item,Order Date,Delivery Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code
0,366000,1,1/1/2016,NaN,265598,10,1304,1,CAD
1,366001,1,1/1/2016,1/13/2016,1269051,0,1048,2,USD
2,366001,2,1/1/2016,1/13/2016,1269051,0,2007,1,USD
3,366002,1,1/1/2016,1/12/2016,266019,0,1106,7,CAD
4,366002,2,1/1/2016,1/12/2016,266019,0,373,1,CAD

In [24]:
sales.describe()

,Order Number,Line Item,CustomerKey,StoreKey,ProductKey,Quantity
count,6.288400e+04,62884.000000,6.288400e+04,62884.000000,62884.000000,62884.000000
mean,1.430905e+06,2.164207,1.180797e+06,31.802144,1125.859344,3.144790
std,4.532963e+05,1.365170,5.859634e+05,22.978188,709.244010,2.256371
min,3.660000e+05,1.000000,3.010000e+02,0.000000,1.000000,1.000000
25%,1.121017e+06,1.000000,6.808580e+05,8.000000,437.000000,1.000000
50%,1.498016e+06,2.000000,1.261200e+06,37.000000,1358.000000,2.000000
75%,1.788010e+06,3.000000,1.686496e+06,53.000000,1650.000000,4.000000
max,2.243032e+06,7.000000,2.099937e+06,66.000000,2517.000000,10.000000

In [25]:
sales.describe(include='object')

        Order Date Delivery Date Currency Code
count        62884         13165         62884
unique        1641          1492             5
top     12/21/2019      1/6/2020           USD
freq           222            50         33767

In [26]:
pro = pd.read_csv('Products.csv')

In [27]:
pro.head()

,ProductKey,Product Name,Brand,Color,Unit Cost USD,Unit Price USD,SubcategoryKey,Subcategory,CategoryKey,Category
0,1,Contoso 512MB MP3 Player E51 Silver,Contoso,Silver,$6.62,$12.99,101,MP4&MP3,1,Audio
1,2,Contoso 512MB MP3 Player E51 Blue,Contoso,Blue,$6.62,$12.99,101,MP4&MP3,1,Audio
2,3,Contoso 1G MP3 Player E100 White,Contoso,White,$7.40,$14.52,101,MP4&MP3,1,Audio
3,4,Contoso 2G MP3 Player E200 Silver,Contoso,Silver,$11.00,$21.57,101,MP4&MP3,1,Audio
4,5,Contoso 2G MP3 Player E200 Red,Contoso,Red,$11.00,$21.57,101,MP4&MP3,1,Audio

In [28]:
pro.shape

(2517, 10)

In [29]:
pro.describe()

        ProductKey  SubcategoryKey  CategoryKey
count  2517.000000     2517.000000  2517.000000
mean   1259.000000      491.810091     4.878824
std     726.739637      229.887134     2.299170
min       1.000000      101.000000     1.000000
25%     630.000000      305.000000     3.000000
50%    1259.000000      406.000000     4.000000
75%    1888.000000      801.000000     8.000000
max    2517.000000      808.000000     8.000000

In [30]:
pro.describe(include='object')

,Product Name,Brand,Color,Unit Cost USD,Unit Price USD,Subcategory,Category
count,2517,2517,2517,2517,2517,2517,2517
unique,2517,11,16,480,426,32,8
top,Contoso In-Line Coupler E180 Silver,Contoso,Black,$15.29,$29.99,Computers Accessories,Home Appliances
freq,1,710,602,34,30,201,661

In [31]:
store = pd.read_csv('Stores.csv')

In [32]:
store.dtypes

StoreKey           int64
Country           object
State             object
Square Meters    float64
Open Date         object
dtype: object

In [33]:
store.shape

(67, 5)

In [34]:
store.head()

   StoreKey    Country                         State  Square Meters  Open Date
0         1  Australia  Australian Capital Territory          595.0   1/1/2008
1         2  Australia            Northern Territory          665.0  1/12/2008
2         3  Australia               South Australia         2000.0   1/7/2012
3         4  Australia                      Tasmania         2000.0   1/1/2010
4         5  Australia                      Victoria         2000.0  12/9/2015

In [35]:
store.describe()

        StoreKey  Square Meters
count  67.000000      66.000000
mean   33.000000    1402.196970
std    19.485037     576.404058
min     0.000000     245.000000
25%    16.500000    1108.750000
50%    33.000000    1347.500000
75%    49.500000    2000.000000
max    66.000000    2105.000000

In [36]:
store.describe(include='object')

              Country                         State Open Date
count              67                            67        67
unique              9                            67        25
top     United States  Australian Capital Territory  1/1/2010
freq               24                             1         9

### 2. Variable Type and their distribution for customer table

In [37]:
customer_categorical = customer.select_dtypes(include=['object', 'category']).columns
customer_continuous = customer.select_dtypes(include=['int64', 'float64']).columns

In [38]:
customer_categorical

Index(['Gender', 'Name', 'City', 'State Code', 'State', 'Zip Code', 'Country',
       'Continent', 'Birthday'],
      dtype='object')

In [39]:
customer_continuous

Index(['CustomerKey'], dtype='object')

In [47]:
customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15266 entries, 0 to 15265
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   CustomerKey  15266 non-null  int64
 1   Gender       15266 non-null  object
 2   Name         15266 non-null  object
 3   City         15266 non-null  object
 4   State Code   15256 non-null  object
 5   State        15266 non-null  object
 6   Zip Code     15266 non-null  object
 7   Country      15266 non-null  object
 8   Continent    15266 non-null  object
 9   Birthday     15266 non-null  object
dtypes: int64(1), object(9)
memory usage: 1.2+ MB

In [45]:
customer['Zip Code'].value_counts()

Zip Code
90017      70
S4P 3Y2    50
H3C 5K4    37
48075      28
V6B 3K9    27
           ..
5676        1
28716       1
59035       1
28262       1
44460       1
Name: count, Length: 9505, dtype: int64

In [44]:
customer['Country'].value_counts()

Country
United States     6828
United Kingdom    1944
Canada            1553
Germany           1473
Australia         1420
Netherlands        733
France             670
Italy              645
Name: count, dtype: int64

Since zip code gives us a more precise location than city , state, state code thus we can remove the state, state code and city, Continent and keep two columns regarding the locations that is zip code and country. Therefore we are keeping columns CustomerKey, Gender, Zip Code, Country, Birthday, Name
and removing other unnecessary